#ifndef _core_hpp_include_
#define _core_hpp_include_

// Core: A simple single header library to enhance C++ /////////////////////////
// See end of file for License information.
//
// This is a single header full of utilities that I consider to be either
// essential or extremely important for a programming language like C++.
//
// Main features include:
// - No usage of `virtual`
// - No exceptions, errors are just values.
// - No implict memory allocations
// - Defer
// - Custom Allocator support without "polymorphic resource" madness
// - Vector arithmetic built in
// - Track calls with the `Caller_Location` macro
// - dynamic_array, stack, queue, hash_map (TODO) that use the Allocator interface
//   to get resources
// - Memory Arena, convenience functions such as make() and make_slice()
// - Slice-centric design to prevent bounds checking problems
// - Environment constexpr variables and macros for conditional compilation
// - Still be able to take advantage of newer C++20 features
// - String type that is UTF-8 centric
//
// Requires C++20 or above, you can make this work with C++17 if you get rid of
// the Caller_Location feature.

// Primitive Types: Built-ins //////////////////////////////////////////////////
#ifndef _types_hpp_include_
#define _types_hpp_include_

#include <cstddef>
#include <cstdint>

namespace x {
using i8  = int8_t;
using i16 = int16_t;
using i32 = int32_t;
using i64 = int64_t;
using u8  = uint8_t;
using u16 = uint16_t;
using u32 = uint32_t;
using u64 = uint64_t;

using usize = size_t;
using isize = ptrdiff_t;

using uintptr = uintptr_t;

using byte = unsigned char;
using rune = u32;

// Some machines don't have access to float 16
#ifndef DISABLE_FLOAT16
using f16 = _Float16;
#endif
using f32 = float;
using f64 = double;

#ifndef __STDC_NO_COMPLEX_
using complex64  = _Complex float;
using complex128 = _Complex double;
#endif

namespace prefix {
constexpr auto kilo = isize(1'000);
constexpr auto mega = isize(1'000) * kilo;
constexpr auto giga = isize(1'000) * mega;
constexpr auto tera = isize(1'000) * giga;
constexpr auto peta = isize(1'000) * tera;
constexpr auto exa  = isize(1'000) * peta;

constexpr auto kibi = isize(1024);
constexpr auto mebi = isize(1024) * kibi;
constexpr auto gibi = isize(1024) * mebi;
constexpr auto tebi = isize(1024) * gibi;
constexpr auto pebi = isize(1024) * tebi;
constexpr auto exbi = isize(1024) * pebi;
}
// Make sure this isn't some weird platform
static_assert(sizeof(usize) == sizeof(isize), "Mismatched isize and usize");
static_assert(sizeof(byte) == sizeof(char), "Literally impossible");
#ifndef DISABLE_FLOAT16
static_assert(sizeof(f16) == 2, "Wrong size for f16");
#endif
static_assert(sizeof(f32) == 4, "Wrong size for f32");
static_assert(sizeof(f64) == 8, "Wrong size for f64");
static_assert(sizeof(complex64) == 8, "Wrong size for complex64");
static_assert(sizeof(complex128) == 16, "Wrong size for complex128");
}

#ifdef USE_CORE_BUILTIN_TYPES
using x::i8;
using x::i16;
using x::i32;
using x::i64;
using x::u8;
using x::u16;
using x::u32;
using x::u64;
using x::usize;
using x::isize;
using x::uintptr;
using x::byte;
using x::rune;
#ifndef DISABLE_FLOAT16
using x::f16;
#endif
using x::f32;
using x::f64;
#ifndef __STDC_NO_COMPLEX_
using x::complex64;
using x::complex128;
#endif
#endif

#endif /* Include guard */
// Environment and Standard Includes ///////////////////////////////////////////
#ifndef _environment_hpp_include_
#define _environment_hpp_include_

#include <source_location>
#include <bit>
// NOTE: Do **NOT** change the order of the ifdefs
#if defined(__clang__)
	#define COMPILER_VENDOR_CLANG 1
#elif defined(__GNUC__) && !defined(__clang__)
	#define COMPILER_VENDOR_GCC 1
#elif defined(_MSVC_VER)
	#define COMPILER_VENDOR_MSVC 1
#else
	#define COMPILER_VENDOR_UNKNOWN 1
#endif

